# [作業目標]

1. [簡答題] 請問下列四種不同的 DataFrame 選取結果有什麼差異？

```
df.loc[ '2013-01-01', 'A'] 
df.loc[ '2013-01-01', ['A', 'B'] ] 
df.loc[ '2013-01-01':'2013-01-02', 'A' ] 
df.loc[ '2013-01-01':'2013-01-05', 'A':'C'] 
```


2. 請根據提供的資料，選擇出下列的要求：

```
# - select the first 3 rows.
# - select the odd rows. (index = 1, 3, 5)
# - select the last 2 columns.
# - select the even columns. (index = 0, 2, 4)
```

3. 請根據提供的資料，選擇出下列的要求：

```
# - 1. filtered by first column > 20?
# - 2. filtered by first column + second column > 50
# - 3. filtered by first column < 30 or second column > 30
# - 4. filtered by total sum of row > 100
```

# 作業

### 1. [簡答題] 請問下列四種不同的 DataFrame 選取結果有什麼差異？

```
df.loc[ '2013-01-01', 'A'] 
df.loc[ '2013-01-01', ['A', 'B'] ] 
df.loc[ '2013-01-01':'2013-01-02', 'A' ] 
df.loc[ '2013-01-01':'2013-01-05', 'A':'C'] 
```

In [ ]:
'''
取出資料型態不同
df.loc[ '2013-01-01', 'A']          =>取出數值型的資料
df.loc[ '2013-01-01', ['A', 'B'] ]     =>取出series的資料
df.loc[ '2013-01-01':'2013-01-02', 'A' ]   =>取出series的資料
df.loc[ '2013-01-01':'2013-01-05', 'A':'C']  =>取出DataFrame的資料
'''

### 2. 請根據提供的資料，選擇出下列的要求：

```
# - select the first 3 rows.
# - select the odd rows. (index = 1, 3, 5)
# - select the last 2 columns.
# - select the even columns. (index = 0, 2, 4)
```

In [10]:
# 記得先 Import 正確的套件
import numpy as np
import pandas   as pd

In [73]:
df = pd.DataFrame(np.random.randn(6,3),columns=['col1','col2','col3'])
df

       col1      col2      col3
0 -0.864108  1.199311  0.394253
1  0.480102 -0.189080 -1.851644
2  0.442312 -0.013696 -2.440978
3 -2.953464  1.447995 -0.856438
4 -1.343079  0.604607 -0.066235
5  0.351488  0.492876  0.720723

In [79]:
print('# - select the first 3 rows.')
print(df[:3])


print()
print('# - select the odd rows. (index = 1, 3, 5)')
print(df[1::2])
print(df[(df.index==1)|(df.index==3)|(df.index==5)])


print()
print('# - select the last 2 columns.')
print(df.iloc[:,-2:])


print()
print('# - select the even columns. (index = 0, 2, 4)')
print(df.iloc[:,0::2])

# - select the first 3 rows.
       col1      col2      col3
0 -0.864108  1.199311  0.394253
1  0.480102 -0.189080 -1.851644
2  0.442312 -0.013696 -2.440978

# - select the odd rows. (index = 1, 3, 5)
       col1      col2      col3
1  0.480102 -0.189080 -1.851644
3 -2.953464  1.447995 -0.856438
5  0.351488  0.492876  0.720723
       col1      col2      col3
1  0.480102 -0.189080 -1.851644
3 -2.953464  1.447995 -0.856438
5  0.351488  0.492876  0.720723

# - select the last 2 columns.
       col2      col3
0  1.199311  0.394253
1 -0.189080 -1.851644
2 -0.013696 -2.440978
3  1.447995 -0.856438
4  0.604607 -0.066235
5  0.492876  0.720723

# - select the even columns. (index = 0, 2, 4)
       col1      col3
0 -0.864108  0.394253
1  0.480102 -1.851644
2  0.442312 -2.440978
3 -2.953464 -0.856438
4 -1.343079 -0.066235
5  0.351488  0.720723

### 3. 請根據提供的資料，選擇出下列的要求：

```
# - 1. filtered by first column > 20?
# - 2. filtered by first column + second column > 50
# - 3. filtered by first column < 30 or second column > 30
# - 4. filtered by total sum of row > 100
```

In [61]:
df = pd.DataFrame(np.random.randint(10, 40, 60).reshape(-1, 4))
df

     0   1   2   3
0   29  27  38  21
1   22  22  33  30
2   37  25  16  14
3   37  22  34  33
4   17  32  11  26
5   29  38  14  11
6   37  16  16  10
7   34  18  32  18
8   31  39  35  29
9   35  37  29  10
10  12  12  12  12
11  17  11  16  28
12  13  37  33  16
13  37  22  11  31
14  23  22  26  10

In [69]:
print('# - 1. filtered by first column > 20?')
print(df[df[0]>20])

print()
print('# - 2. filtered by first column + second column > 50')
print(df[df[0]+df[1]>50])

print()
print('# - 3. filtered by first column < 30 or second column > 30')
print(df[(df[0]<30)|(df[1]>30)])

print()
print('# - 4. filtered by total sum of row > 100')
print(df[(df[0]+df[1]+df[2]+df[3])>100])
print(df[df.sum(axis=1)>100])

# - 1. filtered by first column > 20?
     0   1   2   3
0   29  27  38  21
1   22  22  33  30
2   37  25  16  14
3   37  22  34  33
5   29  38  14  11
6   37  16  16  10
7   34  18  32  18
8   31  39  35  29
9   35  37  29  10
13  37  22  11  31
14  23  22  26  10

# - 2. filtered by first column + second column > 50
     0   1   2   3
0   29  27  38  21
2   37  25  16  14
3   37  22  34  33
5   29  38  14  11
6   37  16  16  10
7   34  18  32  18
8   31  39  35  29
9   35  37  29  10
13  37  22  11  31

# - 3. filtered by first column < 30 or second column > 30
     0   1   2   3
0   29  27  38  21
1   22  22  33  30
4   17  32  11  26
5   29  38  14  11
8   31  39  35  29
9   35  37  29  10
10  12  12  12  12
11  17  11  16  28
12  13  37  33  16
14  23  22  26  10

# - 4. filtered by total sum of row > 100
     0   1   2   3
0   29  27  38  21
1   22  22  33  30
3   37  22  34  33
7   34  18  32  18
8   31  39  35  29
9   35  37  29  10
13  37  22  11  31
     0   1   2   3
0   29  27  38  21
1   22  22  33  30
3   37  22  34  33
7   34  18  32  18
8   31  39  35  29
9   35  37  29  10
13  37  22  11  31